Revit 2027 API
BuiltInFailures.RevolutionFailures.ProfileNotPlanar Property
 The Profile must lie in a plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProfileNotPlanar { get; }
Public Shared ReadOnly Property ProfileNotPlanar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProfileNotPlanar {
	FailureDefinitionId^ get ();
}
static member ProfileNotPlanar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevolutionFailures Class
Autodesk.Revit.DB Namespace